In [1]:
import pandas as pd

# Series

In [2]:
temp = pd.Series([10,20,30,40])
print(temp)

0    10
1    20
2    30
3    40
dtype: int64

In [3]:
temp[0]

10

# Series Index 설정

In [4]:
temp = pd.Series([10,20,30,40], index=['One','Two','Three','Four'])
print(temp)

One      10
Two      20
Three    30
Four     40
dtype: int64

In [5]:
temp['One']

10

# DataFrame

In [6]:
data = {
    '이름' : ['A','B','C','D','E'],
    '나이' : [14,15,16,17,18],
    '번호' : [1,2,3,4,5]
} #객체 형태
data

{'이름': ['A', 'B', 'C', 'D', 'E'],
 '나이': [14, 15, 16, 17, 18],
 '번호': [1, 2, 3, 4, 5]}

In [7]:
type(data)

dict

In [8]:
df = pd.DataFrame(data)
df

  이름  나이  번호
0  A  14   1
1  B  15   2
2  C  16   3
3  D  17   4
4  E  18   5

In [9]:
df[['이름', '번호']]

  이름  번호
0  A   1
1  B   2
2  C   3
3  D   4
4  E   5

# DataFrame Index 설정

In [10]:
df = pd.DataFrame(data, index = ['첫번째','두번째','세번째','네번째','다섯번째'])
df

     이름  나이  번호
첫번째   A  14   1
두번째   B  15   2
세번째   C  16   3
네번째   D  17   4
다섯번째  E  18   5

# DataFrame Columns 설정

In [11]:
df = pd.DataFrame(data, columns=['이름','번호','나이'])
df

  이름  번호  나이
0  A   1  14
1  B   2  15
2  C   3  16
3  D   4  17
4  E   5  18

In [13]:
df.index.name='선수번호'
df

     이름  번호  나이
선수번호
0     A   1  14
1     B   2  15
2     C   3  16
3     D   4  17
4     E   5  18

In [15]:
df.set_index('이름')

    번호  나이
이름
A    1  14
B    2  15
C    3  16
D    4  17
E    5  18

In [18]:
df.sort_index(ascending = False) #내림차순 정렬, True 일 경우 오름차순

     이름  번호  나이
선수번호
4     E   5  18
3     D   4  17
2     C   3  16
1     B   2  15
0     A   1  14

In [19]:
data = {
    '이름' : ['A','B','C','D','E'],
    '나이' : [14,15,16,17,18],
    '번호' : [1,2,3,4,5],
    '국어' : [55,66,77,88,99],
    '수학' : [33,22,44,11,66],
    '영어' : [11,22,11,66,32]
} #객체 형태
df = pd.DataFrame(data)
df

  이름  나이  번호  국어  수학  영어
0  A  14   1  55  33  11
1  B  15   2  66  22  22
2  C  16   3  77  44  11
3  D  17   4  88  11  66
4  E  18   5  99  66  32

# 파일로 저장하기

In [27]:
df = pd.DataFrame(data, index = [1,2,3,4,5])
df

  이름  나이  번호  국어  수학  영어
1  A  14   1  55  33  11
2  B  15   2  66  22  22
3  C  16   3  77  44  11
4  D  17   4  88  11  66
5  E  18   5  99  66  32

In [22]:
df.index.name = '순위'

In [23]:
df

   이름  나이  번호  국어  수학  영어
순위
1   A  14   1  55  33  11
2   B  15   2  66  22  22
3   C  16   3  77  44  11
4   D  17   4  88  11  66
5   E  18   5  99  66  32

In [3]:
data = {
    '이름' : ['A','B','C','D','E'],
    '나이' : [14,15,16,17,18],
    '번호' : [1,2,3,4,5],
    '국어' : [55,66,77,88,99],
    '수학' : [33,22,44,11,66],
    '영어' : [11,22,11,66,32]
} #객체 형태
df = pd.DataFrame(data)
df
df.to_csv('ranking.csv', encoding='utf-8-sig') #csv 파일로 변환, 위치 : C:\Users\Speria\anaconda3\Scripts\Python

In [4]:
df.to_csv('ranking.txt', sep='\t') #표처럼 만들기

# 파일 열기

In [28]:
df = pd.read_csv('ranking.csv') #skiprows : 처음 n줄 무시, nrows : n줄만 가져옴

In [29]:
df

   순위 이름  나이  번호  국어  수학  영어
0   1  A  14   1  55  33  11
1   2  B  15   2  66  22  22
2   3  C  16   3  77  44  11
3   4  D  17   4  88  11  66
4   5  E  18   5  99  66  32